Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/carers/respite_care_grant.html.txt.tmx
Source language: en
Languages: ga

source: Carer's Support Grant (formerly called Respite Care Grant)
ga: Deontas Tacaíochta do Chúramóirí (ar a dtugadh an Deontas Cúraim Faoisimh)

source: The Carer's Support Grant is an annual payment made to carers by the Department of Social Protection
ga: Is íocaíocht bhliantúil atá sa Deontas Tacaíochta do Chúramóirí a dhéantar le cúramóirí ón Roinn Coimirce Sóisialaí

source: The scheme name was changed in 2016 to better reflect how the Grant is used by carers
ga: Athraíodh ainm na scéime sa bhliain 2016 chun an bealach ina mbaineann cúramaóirí leas aisti a léiriú níos fearr

source: It was formerly called the Respite Care Grant
ga: Tugadh an Deontas Cúraim Faoisimh air roimhe seo

source: Carers can use the grant in whatever way they wish
ga: Is féidir le cúramóirí leas a bhaint as an deontas pé bealach ar mian leo

source: You can use the grant to pay for respite care if you wish, but you do not have to do so
ga: Is féidir leat leas a bhaint as an deontas do chúramh faoisimh más mian leat, ach ní gá duit é a dhéanamh

source: More information about respite care facilities is available
ga: Tá a thuilleadh eolais faoi shaoráidí cúraim faoisimh ar fáil

source: In June of each year (usually on the first Thursday of the month), the Department of Social Protection pays the grant automatically to carers getting Carer's Allowance, Carer's Benefit, or Domiciliary Care Allowance from the Department
ga: Íocann an Roinn Coimirce Sóisialaí an deontas go huathoibríoch i mí an Mheithimh gach bliain (an chéad Déardaoin den mhí de ghnáth), le cúramóirí ag fáil Liúntais Chúramóra, Sochair Chúramóra, nó Liúntais Chúraim Bhaile ón Roinn

source: Only one Carer's Support Grant can be paid for each person getting care
ga: Ní féidir ach Deontas Tacaíochta Cúramóra amháin a íoc do gach duine a fhaigheann cúram

source: The grant is paid to people getting any of the payments mentioned above
ga: Íoctar an deontas le daoine a fhaigheann ceann ar bith de na híocaíochtaí thuasluaite

source: It can also be paid to certain other carers providing full-time care
ga: Is féidir é a íoc freisin le cúramóirí áirithe eile a sholáthraíonn cúram lánaimseartha

source: If you are not getting any of the above payments, you must be:
ga: Mura bhfaigheann tú ceann ar bith de na híocaíochtaí thuas, ní foláir duit bheith:

source: • Aged 16 or over
ga: • D’aois 16 bliain nó os a chionn

source: • Ordinarily resident in the State
ga: • I do ghnáthchónaí sa Stát

source: • Caring for the person on a full-time basis
ga: • Ag tabhairt cúraim don duine ar bhunús lánaimseartha

source: • Caring for the person for at least 6 months - this period must include the first Thursday in June
ga: • Ag tabhairt cúraim don duine ar feadh 6 mhí ar a laghad - caithfear an chéad Déardaoin i mí an Mheithimh a áireamh leis an tréimhse úd

source: • Living with the person being cared for or, if not, be contactable quickly by a direct system of communication (for example, telephone or alarm)
ga: • I do chónaí leis an duine dá dtugtar cúram, nó mura gcónaíonn, bheith inteaghmhálaithe go tapa trí chóras cumarsáide díreach (mar shampla, fón nó aláram)

source: • Working more than 15 hours per week outside the home
ga: • Má théann tú ag obair ar feadh níos mó ná 15 uair in aghaidh na seachtaine lasmuigh den bhaile

source: • Taking part in an education or training course for more than 15 hours a week
ga: • Má fhaigheann tú Liúntas Cuardaitheora Poist nó Sochar Cuardaitheora Poist

source: • Getting Jobseeker's Allowance or Jobseeker's Benefit • Signing on for credited contributions
ga: • Má shíníonn tú isteach i gcomhair ranníocaíochtaí creidiúnaithe árachais shóisialaigh

source: • Living in a hospital, convalescent home or similar institution
ga: • Má ta cónaí ort in ospidéal, in ionad téarnaimh nó in institiúid chomhchosúil

source: If you are caring for more than one person, a grant is paid for each of them
ga: Má thugann tú cúram do níos mó ná duine amháin, íoctar deontas i gcomhair gach duine acu

source: A Carer's Support Grant of €1,700 (June 2017) is paid once each year, usually on the first Thursday in June, for each person you are caring for
ga: Íoctar Deontas Tacaíochta Cúramóra ar fiú €1,700 é (Meitheamh 2017) uair amháin in aghaidh na bliana, go hiondúil an chéad Déardaoin i mí an Mheithimh, i leith gach duine dá dtugann tú cúram

source: If you are getting Carer's Allowance, Carer's Benefit or Domiciliary Care Allowance from the Department of Social Protection, you do not need to apply for the Carer's Support Grant
ga: Ní gá duit iarratas a dhéanamh don Deontas Tacaíochta Cúramóra má fhaigheann tú Liúntas Cúramóra, Sochar Cúramóra nó Liúntas Cúraim Bhaile ón Roinn Coimirce Sóisialaí

source: It will be automatically paid to you in June
ga: Íocfar go huathoibríoch leat é i mí an Mheithimh

source: If you are not getting any of these payments you should fill in an application form CSG 1 (pdf) in respect of each person you are caring for
ga: Mura bhfaigheann tú ceann ar bith de na híocaíochtaí úd ba chóir duit foirm iarratais CSG 1 (pdf) a chomhlánú i leith gach duine dá dtugann tú cúram

source: If you were not getting one of the above payments in 2016, but still got the Carer's Support Grant, you do not need to reapply for 2017
ga: Mura bhfuair tú ceann ar bith de na híocaíochtaí thuas agus go bhfuair tú an Deontas Tacaíochta do Chúramóirí i 2016, ní gá duit iarratas a dhéanamh in athuair i 2017

source: If you got the grant in 2016, you will have received a letter in April 2017 from the Carer's Support Grant section in the Department of Social Protection, together with a short 2-page questionnaire
ga: Má fuair tú an deontas i 2016, cuireadh litir chugat i mí Aibreáin 2017 ó rannóg Deontais Tacaíochta Cúramóra sa Roinn Coimirce Sóisialaí le ceistneoir ghairid 2 leathanach

source: You must answer the questions on the questionnaire and return it to the Carer's Support Grant section
ga: Ní mór duit na ceisteanna ar an gceistneoir a fhreagairt agus í a sheoladh ar ais chuig rannóg Deontas Tacaíochta Cúramóra

source: After you return the questionnaire, the Department will use this and the information on file to reassess you for the Carer's Support Grant
ga: Tar éis duit an cheistneoir a sheoladh ar ais, bainfidh an Roinn úsáid aisti agus as an bhfaisnéis ata sa chomhad cheana féin chun do Dheontas Tacaíochta Cúramóra a athmheasúnú

source: You can apply for a Carer's Support Grant for any given year from April of that year until 31 December of the following year
ga: Is féidir leat iarratas a dhéanamh don deontas i leith bliana ar bith ó Aibreán na bliana sin nó go dtí 31 Nollaig den bhlian dár gcionn

source: So, for example, you can apply for a grant for 2017 at any time from April 2017 up until 31 December 2018
ga: Is féidir leat mar sin iarratas a dhéanamh do dheontas i leith na bliana 2017 ó Aibreán 2016 síos go dtí 31 Nollaig 2018

source: You can download a Carer's Support Grant application form or get one from your Intreo Centre or Social Welfare Branch Office or Citizens Information Centre
ga: Is féidir leat foirm iarratais a ioslódail (féach thuas) nó ceann a fháil ó oifig leasa shóisialaigh, ó oifig Intreo nó ó Lárionad Faisnéise do Shaoránaigh
